// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "最爱的小公主",  // 同上...
        "今天是你的生日",
        "这是我为你庆祝的第一个生日",
        "我希望你能一直开开心心的",
        "也希望我能一直陪伴你",
        "希望你旦逢良辰，顺颂时宜",
        "希望你事事顺意",
        "我也会陪伴你很久的",
        "此生永远爱你",
        "MUMA~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "小公主点这里",
        play: "音乐",
        bannar_coming: "生日快乐",
        balloons_flying: "好像少点东西",
        cake_fadein: "榴莲千层蛋糕哦",
        light_candle: "可以许愿的蜡烛，许个生日愿望哦",
        wish_message: "生日快乐呀宝宝",
        story: "给我最喜欢的人的话",
    }
};
